# map 함수
- 각각의 element에 대해서 함수를 적용시킬 때 사용한다

In [8]:
# 아래의 string list를 숫자로 바꾸고 싶다
my_string = ['0', '1', '2', '3']

int(my_string)

TypeError: int() argument must be a string, a bytes-like object or a number, not 'list'

In [7]:
# 각각의 element에 대해서 int 함수를 적용한 결과를 리턴한다
list(map(int, my_string))

[0, 1, 2, 3]

# lambda 함수
- 간단한 함수를 만들어서 써야하는데, 정식 함수를 만들자니 귀찮고 큰 의미는 없을 때 사용한다.
- 일반적으로 한 스크립트에서 3번 이상 사용되면 함수로 만든다.

In [5]:
my_list = ['apple', 'banana', 'candy', 'drum', 'elephant']

list(map(lambda x: x[:2], my_list))

['ap', 'ba', 'ca', 'dr', 'el']

In [10]:
a = list(range(10))
b = list(range(100, 200, 10))

print(list(zip(a, b)))

[(0, 100), (1, 110), (2, 120), (3, 130), (4, 140), (5, 150), (6, 160), (7, 170), (8, 180), (9, 190)]

In [11]:
list(map(lambda x, y: x + y, a, b))

[100, 111, 122, 133, 144, 155, 166, 177, 188, 199]

In [14]:
list(map(lambda x, y: x * y, a, b))

[0, 110, 240, 390, 560, 750, 960, 1190, 1440, 1710]

In [15]:
list(filter(lambda x: x >= 5, a))

[5, 6, 7, 8, 9]

# pandas 에서의 map, apply, applymap 활용

In [28]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'col1': ['a', 'b', 'c', 'd', 'd'], 
                   'col2':[101, 102, 103, 104, 105], 
                   'col3':[201, 202, 203, 204, 205]})
df

  col1  col2  col3
0    a   101   201
1    b   102   202
2    c   103   203
3    d   104   204
4    d   105   205

## map 함수는 Series 형태에 적용할 수 있다

In [30]:
df.col1.map(lambda x: x.upper())

0    A
1    B
2    C
3    D
4    D
Name: col1, dtype: object

In [31]:
df.col2.map(lambda x: x - 100)

0    1
1    2
2    3
3    4
4    5
Name: col2, dtype: int64

## apply 함수는 DataFrame 형태에 적용할 수 있다
- 일반적으로 집계낼 때 사용함

In [33]:
df2 = df[['col2', 'col3']]
df2.columns = ['col1', 'col2']
df2

   col1  col2
0   101   201
1   102   202
2   103   203
3   104   204
4   105   205

In [37]:
# 열 별 적용
df2.apply(lambda x: x.max(), axis=0)

col1    105
col2    205
dtype: int64

In [38]:
# 행 별 적용
df2.apply(lambda x: x.max(), axis=1)

0    201
1    202
2    203
3    204
4    205
dtype: int64

In [40]:
df2.apply(lambda x: x.max() - x.min(), axis=0)

col1    4
col2    4
dtype: int64

In [42]:
# axis 생략하면 행 별 적용
df2.apply(lambda x: x.mean())

col1    103.0
col2    203.0
dtype: float64

In [44]:
# 여러 집계값을 출력시킬 수도 있다
df2.apply(lambda x: pd.Series([x.max(), x.min()], index=['max', 'min']))

     col1  col2
max   105   205
min   101   201

# applymap은 apply와 map의 기능을 합쳐놓은 것
- dataframe에 적용 가능하며 각각의 element에 대해서 적용된다

In [46]:
df

  col1  col2  col3
0    a   101   201
1    b   102   202
2    c   103   203
3    d   104   204
4    d   105   205

In [52]:
import string

df.applymap(lambda x: str(x).zfill(5))

    col1   col2   col3
0  0000a  00101  00201
1  0000b  00102  00202
2  0000c  00103  00203
3  0000d  00104  00204
4  0000d  00105  00205